<?php
// +----------------------------------------------------------------------
// | OnlineRetailers [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 2003-2023 www.shopsn.net All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 亿速网络（http://www.shopsn.net）
// +----------------------------------------------------------------------
// | Author: 王强 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace Common\Model;

/**
 * 开店订单
 * @author Administrator
 *
 */
class OpenShopOrderModel extends BaseModel
{
	private static $obj;

	public static $id_d;	//编号

	public static $orderSn_d;	//订单标志

	public static $userId_d;	//用户

	public static $createTime_d;	//创建时间

	public static $payTime_d;	//支付时间

	public static $storeId_d;	//店铺

	public static $type_d;	//类型【0个人入住1 企业入住】

	public static $payType_d;	//支付类型

	public static $payPlatform_d;	//支付平台【 0pc 1 wap 2 app】
	
	public static $orderStatus_d; //支付状态
	
	public static function getInitnation()
	{
		$class = __CLASS__;
		return self::$obj = !( self::$obj instanceof $class ) ? new self() : self::$obj;
	}
}