<?php
// +----------------------------------------------------------------------
// | OnlineRetailers [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 2003-2023 www.shopsn.net All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 亿速网络（http://www.shopsn.net）
// +----------------------------------------------------------------------
// | Author: 王强 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace Common\Model;

/**
 * 店铺会员相关
 * @author Administrator
 *
 */
class StoreMemberModel extends BaseModel
{
	private static $obj;

	public static $id_d;	//编号

	public static $memberId_d;	//用户【编号】

	public static $storeId_d;	//店铺【编号】

	public static $totalTransaction_d;	//交易总额

	public static $transactionNumber_d;	//交易笔数

	public static $lastTime_d;	//上次交易时间

	public static $updateTime_d;	//更新时间

	public static $moneyBig_d;	//金额上限

	public static $moneySmall_d;	//金额下限

	
	public static function getInitnation()
	{
		$name = __CLASS__;
		return self::$obj = !(self::$obj instanceof $name) ? new self() : self::$obj;
	}
}